Revit 2027 API
TextNoteLeaderStyles Enumeration
An enumerated type listing all the Leader styles.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum TextNoteLeaderStyles
Public Enumeration TextNoteLeaderStyles
public enum class TextNoteLeaderStyles
type TextNoteLeaderStyles
Members
Member name | Value | Description
LCS_NONE | 0 | No leader.
LCS_ONE_SEG_ARC | 2 | The leader is an arc.
LCS_ONE_SEG_LINE | 1 | The leader only includes one line segment.
LCS_TWO_SEG_LINE | 3 | The leader include two line segments.
See Also
Reference
Autodesk.Revit.DB Namespace